Revit 2027 API
ParameterTypeId.StairstypeIsAssembledStairs Property
 "Assembled Stair": Whether stairs is assembled
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeIsAssembledStairs { get; }
Public Shared ReadOnly Property StairstypeIsAssembledStairs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeIsAssembledStairs {
	ForgeTypeId^ get ();
}
static member StairstypeIsAssembledStairs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace